In [2]:
import pandas as pd

!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (1.3.10)

In [3]:
import pymysql
from sqlalchemy import create_engine

In [4]:
engine = create_engine('sqlite:////Users/Stefania/downloads/stefaniabraca.db')

# dfpersonal_info

In [5]:
query = "select * from personal_info"
dfpersonal_info = pd.read_sql_query(query, engine)
dfpersonal_info.head()

,id,lastName,age,Unnamed: 0,gender,country,image
0,5227,bEZOS,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,2642,GATES,62 years old,53,M,None,https://specials-images.forbesimg.com/imageser...
2,5422,bufFETT,87 years old,54,M,None,https://specials-images.forbesimg.com/imageser...
3,8183,aRNAULt,69 years old,55,M,France,https://specials-images.forbesimg.com/imageser...
4,5642,zuckeRBERG,1985,56,M,USA,https://specials-images.forbesimg.com/imageser...

In [6]:
dfpersonal_info.columns

Index(['id', 'lastName', 'age', 'Unnamed: 0', 'gender', 'country', 'image'], dtype='object')

In [21]:
dfpersonal_info_column_names = dfpersonal_info.columns

In [24]:
for i in dfpersonal_info_column_names:
  print('{} is unique: {}'.format(i, dfpersonal_info[i].is_unique))

id is unique: True
lastName is unique: False
age is unique: False
Unnamed: 0 is unique: True
gender is unique: False
country is unique: False
image is unique: False

In [20]:
dfpersonal_info.dtypes

id             int64
lastName      object
age           object
Unnamed: 0     int64
gender        object
country       object
image         object
dtype: object

# dfbusiness_info

In [15]:
query = "select * from business_info"
dfbusiness_info = pd.read_sql_query(query, engine)
dfbusiness_info.head()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,5227,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1
1,2642,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2
2,5422,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3
3,8183,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4
4,5642,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5

In [16]:
dfbusiness_info.columns

Index(['id', 'Unnamed: 0', 'Source', 'worth', 'worthChange', 'realTimeWorth',
       'realTimePosition'],
      dtype='object')

In [25]:
dfbusiness_info_column_names = dfbusiness_info.columns

In [26]:
for i in dfbusiness_info_column_names:
  print('{} is unique: {}'.format(i, dfbusiness_info[i].is_unique))

id is unique: True
Unnamed: 0 is unique: True
Source is unique: False
worth is unique: False
worthChange is unique: False
realTimeWorth is unique: False
realTimePosition is unique: False

In [18]:
dfbusiness_info.dtypes

id                   int64
Unnamed: 0           int64
Source              object
worth               object
worthChange         object
realTimeWorth       object
realTimePosition     int64
dtype: object

# dfrank_info

In [12]:
query = "select * from rank_info"
dfrank_info = pd.read_sql_query(query, engine)
dfrank_info.head()

     id                         name  position  Unnamed: 0
0  1431  anANT ASAVABHOKHIN & FAmily       NaN           0
1  7293               arASH FERDowsi       NaN           1
2  3534     banthoON LAMSAM & FAMILy       NaN           2
3  2538       bill ADDERLEY & family       NaN           3
4  2722            borIS ZINGArevich       NaN           4

In [27]:
dfrank_info.columns

Index(['id', 'name', 'position', 'Unnamed: 0'], dtype='object')

In [28]:
dfrank_info_column_names = dfrank_info.columns

In [29]:
for i in dfrank_info_column_names:
  print('{} is unique: {}'.format(i, dfrank_info[i].is_unique))

id is unique: True
name is unique: True
position is unique: False
Unnamed: 0 is unique: True

In [19]:
dfrank_info.dtypes

id              int64
name           object
position      float64
Unnamed: 0      int64
dtype: object